---
kind: enumMember
id: F:Autodesk.Revit.DB.ImageTypeStatus.Unknown
enum: Autodesk.Revit.DB.ImageTypeStatus
source: html/b84b2403-3c15-b917-ec36-7cca79c50c81.htm
---
# Autodesk.Revit.DB.ImageTypeStatus.Unknown

The linked image has not yet been loaded. No image is available.
 This status is only returned before the document is fully opened.